package _ex_20230612;

public class _Example {

	// 1. 카운트 다운 시작

	// 2. 잔잔한 음악이 흐르면서 에피소드 시작을 서술한다.

	// 3. 아이들이 나와 가위바위보 게임을 한다.

	// 4. 뛰어놀던 아이들 소리는 작아지고 심장 고동소리가 커지며
	// 게임이 시작된다.

	// 5. 평화롭고 경쾌한 음악, 주인공이 등장한다.

	// 6. "안녕? 나는 ㅇㅇㅇ 이야. 반가워! 이제부터 너희들과 게임을 할거야.
	// 나를 이겨봐~~~~~!!"
	// "지금부터 마음속에 숫자(생일)를 종이에 써봐. 그 숫자(생일)를 내가 맞춰볼게."
	// "이긴 사람이 다음 게임을 할건지 말건지 정하는거야."
	// "내가 맞히면 게임을 계속 할거야. 내가 틀리면 너희가 정해."
	// "그럼, 시작한다!"

	// 7. 게임 참여자는 마음속으로 숫자(생일)를 생각하고 종이에 쓴다. ( 카운트 다운 )
	// ㅇㅇㅇ 은 숫자를 맞추기 위해 잠시동안 참여자와 계산을 한다.

	// 9. 그리고, 마지막 카운트다운이 시작되고 ㅇㅇㅇ 은 예상되는 숫자를 말한다.
	// 이때, 참여자는 ㅇㅇㅇ 과 함께 숫자를 보이면서 승부가 갈린다.

	// 10. ㅇㅇㅇ 승리하면 게임 계속, 참여자가 승리하면 게임 계속 또는 종료.
}
